{"uid": "838520c01f80f8495abc745494d7a9ba99df6716", "source_id": "microsoft_news", "link": "https://news.microsoft.com/2025/04/30/microsoft-earnings-press-release-available-on-investor-relations-website-26/", "title": "Microsoft earnings press release available on Investor Relations website", "published_at": "Wed, 30 Apr 2025 20:13:07 +0000", "discovered_at": "2025-10-20T16:40:07.524723+08:00", "fetched_at": "2025-10-21T17:47:05.974004+08:00", "fetch_status": "ok", "extracted_text": "REDMOND, Wash. — April 30, 2025 — Microsoft Corp. on Wednesday announced that fiscal year 2025 third-quarter financial results are available on its Investor Relations website. The direct link to the earnings press release is https://www.microsoft.com/en-us/Investor/earnings/FY-2025-Q3/press-release-webcast.\nAs previously announced, the company will host a conference call at 2:30 p.m. Pacific Time. A live webcast of the call can be accessed on Microsoft’s Investor Relations website at https://www.microsoft.com/en-us/Investor/.\nMicrosoft (Nasdaq “MSFT” @microsoft) creates platforms and tools powered by AI to deliver innovative solutions that meet the evolving needs of our customers. The technology company is committed to making AI available broadly and doing so responsibly, with a mission to empower every person and every organization on the planet to achieve more.\nFor more information, financial analysts and investors only:\nInvestor Relations, Microsoft, (425) 706-4400\nFor more information, press only:\nMicrosoft Media Relations, We. Communications, (425) 638-7777, [email protected]\nNote to editors: For more information, news and perspectives from Microsoft, please visit Microsoft Source at https://news.microsoft.com/source. Web links, telephone numbers and titles were correct at time of publication but may since have changed. Shareholder and financial information is available at http://www.microsoft.com/en-us/investor.", "sublinks": [{"url": "...", "extracted_text": null, "fetch_status": "extract_failed", "similarity_to_main": 0.0}, {"url": "https://www.microsoft.com/en-us/Investor/earnings/FY-2025-Q3/press-release-webcast", "extracted_text": "Press Release & Webcast\nEarnings Release FY25 Q3\nMicrosoft Cloud and AI Strength Drives Third Quarter Results\nREDMOND, Wash. — April 30, 2025 — Microsoft Corp. today announced the following results for the quarter ended March 31, 2025, as compared to the corresponding period of last fiscal year:\n· Revenue was $70.1 billion and increased 13% (up 15% in constant currency)\n· Operating income was $32.0 billion and increased 16% (up 19% in constant currency)\n· Net income was $25.8 billion and increased 18% (up 19% in constant currency)\n· Diluted earnings per share was $3.46 and increased 18% (up 19% in constant currency)\n“Cloud and AI are the essential inputs for every business to expand output, reduce costs, and accelerate growth,\" said Satya Nadella, chairman and chief executive officer of Microsoft. “From AI infra and platforms to apps, we are innovating across the stack to deliver for our customers.”\n“We delivered a strong quarter with Microsoft Cloud revenue of $42.4 billion, up 20% (up 22% in constant currency) year-over-year driven by continued demand for our differentiated offerings,” said Amy Hood, executive vice president and chief financial officer of Microsoft.\nBusiness Highlights\nRevenue in Productivity and Business Processes was $29.9 billion and increased 10% (up 13% in constant currency), with the following business highlights:\n· Microsoft 365 Commercial products and cloud services revenue increased 11% (up 14% in constant currency) driven by Microsoft 365 Commercial cloud revenue growth of 12% (up 15% in constant currency)\n· Microsoft 365 Consumer products and cloud services revenue increased 10% (up 12% in constant currency) driven by Microsoft 365 Consumer cloud revenue growth of 10% (up 12% in constant currency)\n· LinkedIn revenue increased 7% (up 8% in constant currency)\n· Dynamics products and cloud services revenue increased 11% (up 13% in constant currency) driven by Dynamics 365 revenue growth of 16% (up 18% in constant currency)\nRevenue in Intelligent Cloud was $26.8 billion and increased 21% (up 22% in constant currency), with the following business highlights:\n· Server products and cloud services revenue increased 22% (up 24% in constant currency) driven by Azure and other cloud services revenue growth of 33% (up 35% in constant currency)\nRevenue in More Personal Computing was $13.4 billion and increased 6% (up 7% in constant currency), with the following business highlights:\n· Windows OEM and Devices revenue increased 3%\n· Xbox content and services revenue increased 8% (up 9% in constant currency)\n· Search and news advertising revenue excluding traffic acquisition costs increased 21% (up 23% in constant currency)\nMicrosoft returned $9.7 billion to shareholders in the form of dividends and share repurchases in the third quarter of fiscal year 2025.\nBusiness Outlook\nMicrosoft will provide forward-looking guidance in connection with this quarterly earnings announcement on its earnings conference call and webcast.\nQuarterly Highlights, Product Releases, and Enhancements\nEvery quarter Microsoft delivers hundreds of products, either as new releases, services, or enhancements to current products and services. These releases are a result of significant research and development investments, made over multiple years, designed to help customers be more productive and secure and to deliver differentiated value across the cloud and the edge.\nHere are the major product releases and other highlights for the quarter, organized by product categories, to help illustrate how we are accelerating innovation across our businesses while expanding our market opportunities.\nEnvironmental, Social, and Governance (ESG)\nTo learn more about Microsoft’s corporate governance and our environmental and social practices, please visit our investor relations Board and ESG website and reporting at Microsoft.com/transparency.\nWebcast Details\nSatya Nadella, chairman and chief executive officer, Amy Hood, executive vice president and chief financial officer, Alice Jolla, chief accounting officer, Keith Dolliver, corporate secretary and deputy general counsel, and Jonathan Neilson, vice president of investor relations, will host a conference call and webcast at 2:30 p.m. Pacific time (5:30 p.m. Eastern time) today to discuss details of the company’s performance for the quarter and certain forward-looking information. The session may be accessed at http://www.microsoft.com/en-us/investor. The webcast will be available for replay through the close of business on April 30, 2026.\nConstant Currency\nMicrosoft\npresents constant currency information to provide a framework for assessing how\nour underlying businesses performed excluding the effect of foreign currency\nrate fluctuations. To present this information, current and comparative prior\nperiod results for entities reporting in currencies other than United States\ndollars are converted into United States dollars using the average exchange\nrates from the comparative period rather than the actual exchange rates in\neffect during the respective periods. All growth comparisons relate to the\ncorresponding period in the last fiscal year. Microsoft has provided this\nnon-GAAP financial information to aid investors in better understanding our\nperformance. The non-GAAP financial measures presented in this release should\nnot be considered as a substitute for, or superior to, the measures of\nfinancial performance prepared in accordance with GAAP.\nFinancial Performance Constant Currency Reconciliation\nSegment Revenue Constant Currency Reconciliation\nWe have recast certain prior period amounts to conform to the way we internally manage and monitor our business.\nSelected Product and Service Revenue Constant Currency Reconciliation\nAbout Microsoft\nMicrosoft (Nasdaq “MSFT” @microsoft) creates platforms and tools powered by AI to deliver innovative solutions that meet the evolving needs of our customers. The technology company is committed to making AI available broadly and doing so responsibly, with a mission to empower every person and every organization on the planet to achieve more.\nForward-Looking Statements\nStatements in this release that are “forward-looking statements” are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors such as:\n· intense competition in all of our markets that may adversely affect our results of operations;\n· focus on cloud-based and AI services presenting execution and competitive risks;\n· significant investments in products and services that may not achieve expected returns;\n· acquisitions, joint ventures, and strategic alliances that may have an adverse effect on our business;\n· impairment of goodwill or amortizable intangible assets causing a significant charge to earnings;\n· cyberattacks and security vulnerabilities that could lead to reduced revenue, increased costs, liability claims, or harm to our reputation or competitive position;\n· disclosure and misuse of personal data that could cause liability and harm to our reputation;\n· the possibility that we may not be able to protect information stored in our products and services from use by others;\n· abuse of our advertising, professional, marketplace, or gaming platforms that may harm our reputation or user engagement;\n· products and services, how they are used by customers, and how third-party products and services interact with them, presenting security, privacy, and execution risks;\n· issues about the use of AI in our offerings that may result in reputational or competitive harm, or legal liability;\n· excessive outages, data losses, and disruptions of our online services if we fail to maintain an adequate operations infrastructure;\n· supply or quality problems;\n· government enforcement under competition laws and new market regulation may limit how we design and market our products;\n· potential consequences of trade and anti-corruption laws;\n· potential consequences of existing and increasing legal and regulatory requirements;\n· laws and regulations relating to the handling of personal data that may impede the adoption of our services or result in increased costs, legal claims, fines, or reputational damage;\n· claims against us that may result in adverse outcomes in legal disputes;\n· uncertainties relating to our business with government customers;\n· additional tax liabilities;\n· sustainability regulations and expectations that may expose us to increased costs and legal and reputational risk;\n· an inability to protect and utilize our intellectual property may harm our business and operating results;\n· claims that Microsoft has infringed the intellectual property rights of others;\n· damage to our reputation or our brands that may harm our business and results of operations;\n· adverse economic or market conditions that may harm our business;\n· catastrophic events or geo-political conditions, such as the COVID-19 pandemic, that may disrupt our business;\n· exposure to increased economic and operational uncertainties from operating a global business, including the effects of foreign currency exchange; and\n· the dependence of our business on our ability to attract and retain talented employees.\nFor more information about risks and uncertainties associated with Microsoft’s business, please refer to the “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Risk Factors” sections of Microsoft’s SEC filings, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q, copies of which may be obtained by contacting Microsoft’s Investor Relations department at (800) 285-7772 or at Microsoft’s Investor Relations website at http://www.microsoft.com/en-us/investor.\nAll information in this release is as of March 31, 2025. The company undertakes no duty to update any forward-looking statement to conform the statement to actual results or changes in the company’s expectations.\nFor more information, press only:\nMicrosoft Media Relations, WE Communications for Microsoft, (425) 638-7777, rrt@we-worldwide.com\nFor more information, financial analysts and investors only:\nJonathan Neilson, Vice President, Investor Relations, (425) 706-4400\nNote to editors: For more information, news and perspectives from Microsoft, please visit the Microsoft News Center at http://www.microsoft.com/news. Web links, telephone numbers, and titles were correct at time of publication, but may since have changed. Shareholder and financial information, as well as today’s 2:30 p.m. Pacific time conference call with investors and analysts, is available at http://www.microsoft.com/en-us/investor.\nDownload Earnings Related Files\nInformation contained in these documents is current as of the earnings date, and not restated for new accounting standards", "fetch_status": "ok", "similarity_to_main": 0.5267361063954985}, {"url": "https://www.microsoft.com/en-us/Investor/", "extracted_text": "Slide %{start} of %{total}. %{slideTitle}\nMicrosoft Corp (MSFT)\nAnnouncements\nI want to...\n-\nThe next earnings release will be on October 29, 2025.\n-\nGet the quarterly dividend amount, record date, ex-dividend date, payable date and history\n-\nPrices display split-adjusted cost basis per share on that date.", "fetch_status": "ok", "similarity_to_main": 0.19252068374336945}, {"url": "https://news.microsoft.com/source", "extracted_text": "Microsoft’s advancements in AI are grounded in our company’s mission to help every person and organization on the planet to achieve more — from helping people be more productive to helping solve society's most pressing problems.View all\nMeet the people and organizations thriving with Microsoft’s security innovations — stories of resilience, trust and protection powered by Microsoft’s Secure Future Initiative and commitment to security above all else.\nView all\nMicrosoft is accelerating progress toward a more sustainable future by working to reduce our environmental footprint, helping our customers build sustainable solutions and advocating for policies that benefit the environment.\nView all", "fetch_status": "ok", "similarity_to_main": 0.350239294972633}, {"url": "http://www.microsoft.com/en-us/investor", "extracted_text": "Slide %{start} of %{total}. %{slideTitle}\nMicrosoft Corp (MSFT)\nAnnouncements\nI want to...\n-\nThe next earnings release will be on October 29, 2025.\n-\nGet the quarterly dividend amount, record date, ex-dividend date, payable date and history\n-\nPrices display split-adjusted cost basis per share on that date.", "fetch_status": "ok", "similarity_to_main": 0.19252068374336945}]}
{"uid": "27efcd57086558954ad3099fd98e4056c404c1f0", "source_id": "microsoft_news", "link": "https://news.microsoft.com/2025/04/30/microsoft-cloud-and-ai-strength-drives-third-quarter-results/", "title": "Microsoft Cloud and AI strength drives third quarter results", "published_at": "Wed, 30 Apr 2025 20:10:30 +0000", "discovered_at": "2025-10-20T16:40:07.524743+08:00", "fetched_at": "2025-10-21T17:47:09.599390+08:00", "fetch_status": "ok", "extracted_text": "Press Release & Webcast\nEarnings Release FY25 Q3\nMicrosoft Cloud and AI Strength Drives Third Quarter Results\nREDMOND, Wash. — April 30, 2025 — Microsoft Corp. today announced the following results for the quarter ended March 31, 2025, as compared to the corresponding period of last fiscal year:\n· Revenue was $70.1 billion and increased 13% (up 15% in constant currency)\n· Operating income was $32.0 billion and increased 16% (up 19% in constant currency)\n· Net income was $25.8 billion and increased 18% (up 19% in constant currency)\n· Diluted earnings per share was $3.46 and increased 18% (up 19% in constant currency)\n“Cloud and AI are the essential inputs for every business to expand output, reduce costs, and accelerate growth,\" said Satya Nadella, chairman and chief executive officer of Microsoft. “From AI infra and platforms to apps, we are innovating across the stack to deliver for our customers.”\n“We delivered a strong quarter with Microsoft Cloud revenue of $42.4 billion, up 20% (up 22% in constant currency) year-over-year driven by continued demand for our differentiated offerings,” said Amy Hood, executive vice president and chief financial officer of Microsoft.\nBusiness Highlights\nRevenue in Productivity and Business Processes was $29.9 billion and increased 10% (up 13% in constant currency), with the following business highlights:\n· Microsoft 365 Commercial products and cloud services revenue increased 11% (up 14% in constant currency) driven by Microsoft 365 Commercial cloud revenue growth of 12% (up 15% in constant currency)\n· Microsoft 365 Consumer products and cloud services revenue increased 10% (up 12% in constant currency) driven by Microsoft 365 Consumer cloud revenue growth of 10% (up 12% in constant currency)\n· LinkedIn revenue increased 7% (up 8% in constant currency)\n· Dynamics products and cloud services revenue increased 11% (up 13% in constant currency) driven by Dynamics 365 revenue growth of 16% (up 18% in constant currency)\nRevenue in Intelligent Cloud was $26.8 billion and increased 21% (up 22% in constant currency), with the following business highlights:\n· Server products and cloud services revenue increased 22% (up 24% in constant currency) driven by Azure and other cloud services revenue growth of 33% (up 35% in constant currency)\nRevenue in More Personal Computing was $13.4 billion and increased 6% (up 7% in constant currency), with the following business highlights:\n· Windows OEM and Devices revenue increased 3%\n· Xbox content and services revenue increased 8% (up 9% in constant currency)\n· Search and news advertising revenue excluding traffic acquisition costs increased 21% (up 23% in constant currency)\nMicrosoft returned $9.7 billion to shareholders in the form of dividends and share repurchases in the third quarter of fiscal year 2025.\nBusiness Outlook\nMicrosoft will provide forward-looking guidance in connection with this quarterly earnings announcement on its earnings conference call and webcast.\nQuarterly Highlights, Product Releases, and Enhancements\nEvery quarter Microsoft delivers hundreds of products, either as new releases, services, or enhancements to current products and services. These releases are a result of significant research and development investments, made over multiple years, designed to help customers be more productive and secure and to deliver differentiated value across the cloud and the edge.\nHere are the major product releases and other highlights for the quarter, organized by product categories, to help illustrate how we are accelerating innovation across our businesses while expanding our market opportunities.\nEnvironmental, Social, and Governance (ESG)\nTo learn more about Microsoft’s corporate governance and our environmental and social practices, please visit our investor relations Board and ESG website and reporting at Microsoft.com/transparency.\nWebcast Details\nSatya Nadella, chairman and chief executive officer, Amy Hood, executive vice president and chief financial officer, Alice Jolla, chief accounting officer, Keith Dolliver, corporate secretary and deputy general counsel, and Jonathan Neilson, vice president of investor relations, will host a conference call and webcast at 2:30 p.m. Pacific time (5:30 p.m. Eastern time) today to discuss details of the company’s performance for the quarter and certain forward-looking information. The session may be accessed at http://www.microsoft.com/en-us/investor. The webcast will be available for replay through the close of business on April 30, 2026.\nConstant Currency\nMicrosoft\npresents constant currency information to provide a framework for assessing how\nour underlying businesses performed excluding the effect of foreign currency\nrate fluctuations. To present this information, current and comparative prior\nperiod results for entities reporting in currencies other than United States\ndollars are converted into United States dollars using the average exchange\nrates from the comparative period rather than the actual exchange rates in\neffect during the respective periods. All growth comparisons relate to the\ncorresponding period in the last fiscal year. Microsoft has provided this\nnon-GAAP financial information to aid investors in better understanding our\nperformance. The non-GAAP financial measures presented in this release should\nnot be considered as a substitute for, or superior to, the measures of\nfinancial performance prepared in accordance with GAAP.\nFinancial Performance Constant Currency Reconciliation\nSegment Revenue Constant Currency Reconciliation\nWe have recast certain prior period amounts to conform to the way we internally manage and monitor our business.\nSelected Product and Service Revenue Constant Currency Reconciliation\nAbout Microsoft\nMicrosoft (Nasdaq “MSFT” @microsoft) creates platforms and tools powered by AI to deliver innovative solutions that meet the evolving needs of our customers. The technology company is committed to making AI available broadly and doing so responsibly, with a mission to empower every person and every organization on the planet to achieve more.\nForward-Looking Statements\nStatements in this release that are “forward-looking statements” are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could differ materially because of factors such as:\n· intense competition in all of our markets that may adversely affect our results of operations;\n· focus on cloud-based and AI services presenting execution and competitive risks;\n· significant investments in products and services that may not achieve expected returns;\n· acquisitions, joint ventures, and strategic alliances that may have an adverse effect on our business;\n· impairment of goodwill or amortizable intangible assets causing a significant charge to earnings;\n· cyberattacks and security vulnerabilities that could lead to reduced revenue, increased costs, liability claims, or harm to our reputation or competitive position;\n· disclosure and misuse of personal data that could cause liability and harm to our reputation;\n· the possibility that we may not be able to protect information stored in our products and services from use by others;\n· abuse of our advertising, professional, marketplace, or gaming platforms that may harm our reputation or user engagement;\n· products and services, how they are used by customers, and how third-party products and services interact with them, presenting security, privacy, and execution risks;\n· issues about the use of AI in our offerings that may result in reputational or competitive harm, or legal liability;\n· excessive outages, data losses, and disruptions of our online services if we fail to maintain an adequate operations infrastructure;\n· supply or quality problems;\n· government enforcement under competition laws and new market regulation may limit how we design and market our products;\n· potential consequences of trade and anti-corruption laws;\n· potential consequences of existing and increasing legal and regulatory requirements;\n· laws and regulations relating to the handling of personal data that may impede the adoption of our services or result in increased costs, legal claims, fines, or reputational damage;\n· claims against us that may result in adverse outcomes in legal disputes;\n· uncertainties relating to our business with government customers;\n· additional tax liabilities;\n· sustainability regulations and expectations that may expose us to increased costs and legal and reputational risk;\n· an inability to protect and utilize our intellectual property may harm our business and operating results;\n· claims that Microsoft has infringed the intellectual property rights of others;\n· damage to our reputation or our brands that may harm our business and results of operations;\n· adverse economic or market conditions that may harm our business;\n· catastrophic events or geo-political conditions, such as the COVID-19 pandemic, that may disrupt our business;\n· exposure to increased economic and operational uncertainties from operating a global business, including the effects of foreign currency exchange; and\n· the dependence of our business on our ability to attract and retain talented employees.\nFor more information about risks and uncertainties associated with Microsoft’s business, please refer to the “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Risk Factors” sections of Microsoft’s SEC filings, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q, copies of which may be obtained by contacting Microsoft’s Investor Relations department at (800) 285-7772 or at Microsoft’s Investor Relations website at http://www.microsoft.com/en-us/investor.\nAll information in this release is as of March 31, 2025. The company undertakes no duty to update any forward-looking statement to conform the statement to actual results or changes in the company’s expectations.\nFor more information, press only:\nMicrosoft Media Relations, WE Communications for Microsoft, (425) 638-7777, rrt@we-worldwide.com\nFor more information, financial analysts and investors only:\nJonathan Neilson, Vice President, Investor Relations, (425) 706-4400\nNote to editors: For more information, news and perspectives from Microsoft, please visit the Microsoft News Center at http://www.microsoft.com/news. Web links, telephone numbers, and titles were correct at time of publication, but may since have changed. Shareholder and financial information, as well as today’s 2:30 p.m. Pacific time conference call with investors and analysts, is available at http://www.microsoft.com/en-us/investor.\nDownload Earnings Related Files\nInformation contained in these documents is current as of the earnings date, and not restated for new accounting standards", "sublinks": [{"url": "...", "extracted_text": null, "fetch_status": "extract_failed", "similarity_to_main": 0.0}, {"url": "http://www.microsoft.com/en-us/investor", "extracted_text": "Slide %{start} of %{total}. %{slideTitle}\nMicrosoft Corp (MSFT)\nAnnouncements\nI want to...\n-\nThe next earnings release will be on October 29, 2025.\n-\nGet the quarterly dividend amount, record date, ex-dividend date, payable date and history\n-\nPrices display split-adjusted cost basis per share on that date.", "fetch_status": "ok", "similarity_to_main": 0.21041750815989319}, {"url": "http://www.microsoft.com/en-us/investor", "extracted_text": "Slide %{start} of %{total}. %{slideTitle}\nMicrosoft Corp (MSFT)\nAnnouncements\nI want to...\n-\nThe next earnings release will be on October 29, 2025.\n-\nGet the quarterly dividend amount, record date, ex-dividend date, payable date and history\n-\nPrices display split-adjusted cost basis per share on that date.", "fetch_status": "ok", "similarity_to_main": 0.21041750815989319}, {"url": "http://www.microsoft.com/news", "extracted_text": "Microsoft’s advancements in AI are grounded in our company’s mission to help every person and organization on the planet to achieve more — from helping people be more productive to helping solve society's most pressing problems.View all\nMeet the people and organizations thriving with Microsoft’s security innovations — stories of resilience, trust and protection powered by Microsoft’s Secure Future Initiative and commitment to security above all else.\nView all\nMicrosoft is accelerating progress toward a more sustainable future by working to reduce our environmental footprint, helping our customers build sustainable solutions and advocating for policies that benefit the environment.\nView all", "fetch_status": "ok", "similarity_to_main": 0.4591601331525709}, {"url": "http://www.microsoft.com/en-us/investor", "extracted_text": "Slide %{start} of %{total}. %{slideTitle}\nMicrosoft Corp (MSFT)\nAnnouncements\nI want to...\n-\nThe next earnings release will be on October 29, 2025.\n-\nGet the quarterly dividend amount, record date, ex-dividend date, payable date and history\n-\nPrices display split-adjusted cost basis per share on that date.", "fetch_status": "ok", "similarity_to_main": 0.21041750815989319}]}
{"uid": "87997f5509c62d89644196b03dc3099b94df5d15", "source_id": "microsoft_news", "link": "https://news.microsoft.com/2025/04/09/microsoft-announces-quarterly-earnings-release-date-63/", "title": "Microsoft announces quarterly earnings release date", "published_at": "Wed, 09 Apr 2025 20:09:32 +0000", "discovered_at": "2025-10-20T16:40:07.524758+08:00", "fetched_at": "2025-10-21T17:47:14.140449+08:00", "fetch_status": "ok", "extracted_text": "REDMOND, Wash. — April 9, 2025 — Microsoft Corp. will publish fiscal year 2025 third-quarter financial results after the close of the market on Wednesday, April 30, 2025, on the Microsoft Investor Relations website at https://www.microsoft.com/en-us/Investor/. A live webcast of the earnings conference call will be made available at 2:30 p.m. Pacific Time.\nMicrosoft (Nasdaq “MSFT” @microsoft) creates platforms and tools powered by AI to deliver innovative solutions that meet the evolving needs of our customers. The technology company is committed to making AI available broadly and doing so responsibly, with a mission to empower every person and every organization on the planet to achieve more.\nFor more information, financial analysts and investors only:\nInvestor Relations, Microsoft, (425) 706-4400\nFor more information, press only:\nMicrosoft Media Relations, WE Communications, (425) 638-7777, [email protected]\nNote to editors: For more information, news and perspectives from Microsoft, please visit Microsoft Source at https://news.microsoft.com/source. Web links, telephone numbers and titles were correct at time of publication but may since have changed. Shareholder and financial information is available at http://www.microsoft.com/en-us/investor.", "sublinks": [{"url": "...", "extracted_text": null, "fetch_status": "extract_failed", "similarity_to_main": 0.0}, {"url": "https://www.microsoft.com/en-us/Investor/", "extracted_text": "Slide %{start} of %{total}. %{slideTitle}\nMicrosoft Corp (MSFT)\nAnnouncements\nI want to...\n-\nThe next earnings release will be on October 29, 2025.\n-\nGet the quarterly dividend amount, record date, ex-dividend date, payable date and history\n-\nPrices display split-adjusted cost basis per share on that date.", "fetch_status": "ok", "similarity_to_main": 0.1951532688975157}, {"url": "https://news.microsoft.com/source", "extracted_text": "Microsoft’s advancements in AI are grounded in our company’s mission to help every person and organization on the planet to achieve more — from helping people be more productive to helping solve society's most pressing problems.View all\nMeet the people and organizations thriving with Microsoft’s security innovations — stories of resilience, trust and protection powered by Microsoft’s Secure Future Initiative and commitment to security above all else.\nView all\nMicrosoft is accelerating progress toward a more sustainable future by working to reduce our environmental footprint, helping our customers build sustainable solutions and advocating for policies that benefit the environment.\nView all", "fetch_status": "ok", "similarity_to_main": 0.36667726049072646}, {"url": "http://www.microsoft.com/en-us/investor", "extracted_text": "Slide %{start} of %{total}. %{slideTitle}\nMicrosoft Corp (MSFT)\nAnnouncements\nI want to...\n-\nThe next earnings release will be on October 29, 2025.\n-\nGet the quarterly dividend amount, record date, ex-dividend date, payable date and history\n-\nPrices display split-adjusted cost basis per share on that date.", "fetch_status": "ok", "similarity_to_main": 0.1951532688975157}]}
